{"intents": [
        {"tag": "telangana",
         "patterns": ["telangana"],
         "responses": [" 1. Waterfall.  2 Resorvoir.  3 Wild Life Sanctuary.  4 Historic. 5 Museum.  6 Lakes. 7 Parks.  8 Film Centers.  9 Amusement park.  10 Bridges."]        
        },
        
	{"tag": "waterfall",
	 	"patterns":["waterfall"],
	 	"responses": [" 1. Mill Creek Falls \n 2. Great Falls of Tinkers Creek \n 3.Bridal Veil Falls \n 4.Brandywine Falls\n 5.Ravine Falls \n 6.Dugway Brook Falls"]
	},
	{"tag":"Mill Creek Falls",
		"patterns":["Mill Creek Falls","MCF"],
		"responses":[" Mill Creek Falls, Cuyahoga County’s tallest waterfall, is located in Cleveland. Mill Creek Falls stands at 48 feet tall."]
		},
	{"tag":"Wild Life Sanctuary",
		"patterns":["Wild Life Sanctuary"],
		"responses":[" 1.Ohio Bird Sanctuary \n 2.Aurora Sanctuary State Nature Preserve \n 3.Mill Creek Wildlife Sanctuary \n 4.Cleveland Metroparks Zoo \n 5. Brukner Nature Center\n 6.Walter C. Best Wildlife Preserve \n 7.Molnar Audubon Sanctuary"]
	},
	{"tag": "Museum",
		"patterns":["Museum"],
		"responses":["1.The Cleveland Museum of Art \n 2.Cleveland History Center \n 3. The Cleveland Museum of Art \n"]
	},
	{"tag": "Kuntala Waterfalls",
		"patterns":["Kuntala Waterfalls"],
		"responses":[" Formed by Kadam River, Kuntala falls cascades down through two steps from a rocky platform. \n It is dangerous to get into water at the bottom  when the water flow is high due to sharp rocks and twists. \n The flow of these falls depends on the release of water from the Kadam Reservoir. \n  The uncertainty of the water release, especially in the rainy season makes Kuntala Waterfalls a slightly dangerous place. \n Timings : 6 am to 6pm \n Entry fee: Free \n Best time to visit: Monsoon and Post Monsoon (Aug-Oct) \n Distance : 263 km from Hyderabad \n Transport type : Bus or car"]
        },
        {"tag": "Mitte Waterfalls",
		"patterns":["Mitte Waterfalls"],
		"responses":[" It comprises not just one but seven waterfalls, hence the name Saptagundala is nestled between tall hills on one side and dense forests on the other, the Saptagundala waterfalls also known as Mitta waterfalls is tucked far away from civilization. \n One has to trek rough and uneven terrain for a distance of three kilometres to reach the spot. Of the seven, the most important waterfalls is Pedda Jalapatam. \n It appears as though the skies have opened up leading to majestic descent of a huge stream of milk. \n Timing: 24 hours open. \n Entry fee: Free Best. \n time to visit: Monsoon(Aug-Oct). \n Distance:  315  km from Hyderabad. \n mode of Transport : Bus or car."]
	},  
        {"tag": "Pochera Waterfalls",
		"patterns":["Pochera Waterfalls"],
		"responses":[" The water flows through rocky bed over several steps to finally descend into a big pool from a height of about 40 feet in 2 steps. \n The surroundings of the falls are maintained well along with a park by Tourism department. \n Road is available till the falls. It is not recommended to get into bottom of the falls during peak monsoons. \n However, there is a small stream at left corner of the main falls where visitors can play safe in the waters. \n Timing: 6:00am to 6:00pm \n Entry fee: Free. \n Best time to visit: M0nsoon and Peak Monsoon(Aug-Dec) \n Distance: 257 km from Hyderabad. \n Transport type: Bus or car."]
        },
        {"tag": "Kanakai Waterfalls",
		"patterns":["Kanakai Waterfalls"],
		"responses":[" The Kanakai waterfall, also called as Kanakadurga waterfalls. \n There is also a Kanaka Durga temple located  near the waterfall. \n Large number of devotees from nearby villages visit the temple during  festivals. \n The waterfall is cascading down from a height of 30 ft. There is a big pool at the bottom of the fall. \n Swimming at the falls is a great experience for the visitors. \n Timing: 24 hours open. \n Entry fee: Free. \n Best time to visit: After monsoon (Aug-Oct). \n Distance: 287 km from Hyderabad. \n mode of Transport: Bus or car."]
	},
        {"tag": "Lower manair dam",
		"patterns":["Lower manair dam"],
		"responses":[" The Lower Manair Dam (LMD) is built across the Manair River, a tributary of Godavari River. \n The construction of the dam was started in 1974 and was finished in 1985. \n The gross storage capacity of the reservoir is 24 TMC. The project serves as a balancing reservoir for Kakatiya Canal and regulates flow below Lower Manair Dam for an ayacut of 5,65,452 acres. \n It is also serves as drinking water source to Karimnagar and Warangal towns. \n The Lower Manair Dam is an important tourist attraction in Karimnagar. \n The dam has 20 floodgates. The serene waters of the Lower Manair Dam and its surrounding areas provide a beautiful view. Boating facility is available in the reservoir. \n Timing:9:00am to 5:00pm \n Entry fee: Free. \n Best time to visit: any time. \n Distance  : 162 km from Hyderabad \n Transport : bus or car ."]
	},
         {"tag": "Sri ram sagar dam",
		"patterns":["Sri ram sagar dam"],
  		"responses":[" It has been described by The Hindu as a 'lifeline for a large part of Telangana. Sri ram sagar  serve  irrigational needs in Karimnagar, Warangal,  Adilabad, Nalgonda, and Khammam districts. \n It also provides drinking water to Warangal city. There is a hydroelectric plant working at the dam site, with 4 turbines each with 9 MW capacity generating 36 MW. \n From 1942 to 1951 Pochampadu site was located 54.50 km below the entry point of Godavari River into AP Territory (now Telangana). \n The Project was further revised in the year 1958. \n Timing: 6:00am to 6:00pm. \n Entry fee: Free. \n Best time to visit: Monsoon and Post Monsoon(Aug-Dec). \n Distance: 208 km from Hyderabad. \n Transport: Bus or car"]
          },
        {"tag": "Nizam sagar dam",
		"patterns":["Nizam sagar dam"],
		"responses":[" Nizam Sagar Dam  is a reservoir constructed across the Manjira River, a tributary of the Godavari River, between  Achampet  and  BanjePally. \n It is located at about 144 km north-west of Hyderabad. Nizam Sagar is the oldest dam in the state of Telangana. \n Nizamsagar dam was constructed in 1923 by Mir Osman Ali Khan - the 7th Nizam of the erstwhile Hyderabad State. \n It was made by emptying over 40 villages length 3km. This masonry dam sprawling  across the river for 3 km with a fourteen feet wide motorable road over it. \n Timing:6:00am to 6:00pm. \n Entry fee: free. \n Best time to visit: Monsoon and Post Monsoon(Aug-Dec). \n Distance : 143 km from Hyderabad \n Transport: Bus or car."]
	},
        {"tag": "Kinnersani dam",
		"patterns":["Kinnersani dam"],
		"responses":[" The Kinnerasani Dam was constructed in 1966 on the Kinnerasani River, one of the important tributaries of Godavari River. \n The dam provides water to Kothagudem Thermal Power Station at Palvoncha for power generation. \n The vast Kinnerasani reservoir harbors number of crocodiles and other aquatic species. \n There are several islands in the middle of the reservoir that are home for variety of wildlife. Boating facility is also available at this reservoir. \n Timing:5:00am to 8:00pm. \n Entry fee: Free. \n Best time to visit: Monsoon and Post Monsoon (Aug-Oct). \n Distance: 292 km from Hyderabad. \n Mode of Transport: Bus or car"]
	},
        {"tag": "Kaddam Project",
		"patterns":["Kaddam Project"],
		"responses":[" The Kadam Dam is also known as Kadam Narayana Reddy dam, named after popular politician of the region. \n It is a major reservoir constructed over Kadam River, a tributary river of Godavari the dam is built at the place where Godavari River merges with River Kadam. \n Construction of the reservoir initiated in 1949 and completed in 1964.The main purpose of this dam is to irrigate about 25000 hectares in Adilabad District. \n However, currently the dam is equipped to irrigate an ayacut of 68000 hectares. \n The dam is popularly known as the Godavari North Canal project. The Project has been integrated with Sriram Sagar Project. \n It has two major canals for water distribution, the Left Canal length is 76.8 km and Right Canal length is about 8 km. \n Entry fee: Free. \n Best time to visit: Monsoon and Post Monsoon(Aug-Dec). \n Distance: 269 km from Hyderabad. \n Mode of Transport: Bus or car"]
	},
        {"tag": "Sri Komaram Bheem Project",
		"patterns":["Sri Komaram Bheem Project"],
		"responses":[" This is a Medium Reservoir has been built across Peddavagu River, a tributary of the Pranahita River. \n This Project proposed to supply water to Komaram Bheem, Wankidi, Kagaznagar, and Sirpur mandals more than 45,000 in acres. \n But currently, the project is providing irrigation water to about 20,000 acres under its left canal 35 km. Right canal will provide irrigation water to about another 25000 acres. \n Timing:6:00am to 6:00pm. \n Entry fee: Free. \n Best time to visit: Monsoon and Post Monsson (Aug-Dec). \n Distance: 326 km from Hyderabad. \n Mode of Transport: Bus or car."]
	},
        {"tag": "Nagarjuna sagar dam",
		"patterns":["Nagarjuna sagar dam"],
		"responses":[" World’s 39th largest masonry dam protected with 26 gates measuring 124.663m in height, Nagarjunasagar Dam located in Nalgonda District is built across River Krishna. \n The dam has astorage capacity of nearly 11,472 million cubic meters with an irrigation capacity for 9.81 lac acres of land. \n The dammeasure 150m tall and 16 kms in length while also being a major tourist attraction. \n In fact, it is among the first irrigationprojects started by Indian Government as an element of Green Revolution. \n Timing: 7:00am to 12:30pm \n Entry fee: 10 Rs. \n Best time to visit: Peak Mansoon(Sep-Oct). \n Distance: 152 km from Hyderabad. \n Transport: Bus or car"]
	},
         {"tag": "Devotional",
		"patterns":["Devotional"],
		"responses":[" 1.Lord laxmi narasimha swamy temple \n 2.Nelakondapalli Budda Stupa \n 3.Sri sri sri Ganapeshwaralayam temple \n 4. Basara Sri Gnana Saraswathi Temple \n 5.Sri Narayan Swamy Temple-Jainath \n 6.Anjaneya swamy temple kondagattu \n 7.Sri Lakshmi Narasimha swami temple Dharmapuri \n 8.Mukteshwara swamy temple kaleshwaram \n 9.Sri koteshwara swamy temple \n 10.Lakshmi Narasimha swamy temple,Nampally \n 11.Sri Raja Rajeshwara swamy temple,Vemulawada \n 12.Bhadra kali temple \n 13.Jain Temple,Kolanupaka \n 14.Ramappa temple \n 15.Sammaka Sarakka temple jatara,Medaram \n 16.Thousand Pillar temple \n 17.Dargha hazrat syed shah lateefullh qadri \n 18.Pachala someshwara temple \n 19.Sri chaya someshwara temple \n 20.Swayambhu Shambhu lingeswara temple"]
	},
        {"tag": "Lord laxmi narasimha swamy temple",
		"patterns":["Lord laxmi narasimha swamy temple"],
		"responses":[" The corners of the ceiling at all 3 entrances have total of 12 sculptures of madanikas marvelously carved in different poses, which are the main attraction of the temple. \n The figures of madanikas made from black granite with metal like finishing resembles the famous sculptures of Belur Cennakesava Temple. \n The roof of the temple is built with bricks, which are so light that they are able to float on water. \n The hall in front of the sanctum is filled with exquisitely carved pillars. \n The walls of the temple exhibit carvings depicting stories from the Mahabharata and the Ramayana. \n Nataraja Ramakrishna revived Perini Shiva Tandavam (Perini Dance), by seeing the sculptures in this temple. \n Timing:6:00am to 6:00pm. \n Entry fee:30 Rs. \n Best time to visit: March-April. \n Distance : 194 km from Hyderabad. \n Mode of Transport : Bus or car."]
	},
        {"tag": "Nelakondapalli Budda Stupa",
		"patterns":["Nelakondapalli Budda Stupa"],
		"responses":[" Nelakondapalli is a historic Buddhist site with Stupas and Buddha idols. \n The site was found during the excavation.conducted in 1977. \n Excavations have unearthed foundations of brick built Viharas, wells, cisterns, a Mahastupa, a bronze idol of Buddha, a miniature Stupa carved in limestone and other materials from the third and fourth centuries. \n Nelakondapalli is associated with the Hindu epic Mahabharata. \n The Virata Raju Dibba and Keechaka Gundam, archaeological evidences from the period of the Mahabharata are located 1.6 km from Nelakondapalli. \n Nelakondapalli is also famous of being the Birth Place of Kancharla Gopanna, popularly known as Bhakta Ramadas who built popular Bhadrachalm temple. \n Timing:5:00am to 8:00pm. \n Entry fee:10 Rs children,20 Rs adult. \n Best time to visit: any time. \n Distance: 196 km from Hyderabad. \n Transport: Bus or car"]
	},
        {"tag": "Sri sri sri Ganapeshwaralayam temple",
		"patterns":["Sri sri sri Ganapeshwaralayam temple"],
		"responses":[" Kusumanchi was known as Krupamani in the Kakatiya period. \n It is home to Sri Ganapeshwaralayam and Mukkanteswaralayam, the two Siva temples built by the Kakatiya rulers during 12th and 13th centuries. \n These temples stand as testimony to the architectural skills of the Kakatiya kings. \n The historical shrines have a striking resemblance to famous Ghanpur and Ramappa temples of Kakatiya period in the Warangal district. \n Ganapeshwaralayam is about 1.7 km from Kusumanchi Bus Stand. \n This temple constructed using stone resembling thousand pillars temple of Warangal in architecture. \n The Shiva lingam in the temple is three meters high with a radius of two meters and it is one of the biggest Shivalingas in the state. \n Timing:9:00am to 7:00pm \n Entry fee:60 Rs. \n Best time to visit: (Aug-Oct). \n Distance: 173 km from Hyderabad. \n Mode of transport: bus or car."]
	},
        {"tag": "Basara Sri Gnana Saraswathi Temple",
		"patterns":["Basara Sri Gnana Saraswathi Temple"],
		"responses":[" Basara is a popular pilgrimage site located in Adilabad district. \n Basara is situated on the banks of River Godavari. \n The Basara temple is a unique temple of Goddess Saraswati, the Hindu Goddess of Knowledge and Learning. \n Children are brought here to do the learning ceremony called Akshara Abyasam. \n It is believed to be one of the two oldest temples of Goddess Saraswathi in India, the other being located in Kashmir. \n According to mytholpgy, Maharishi Vyas, his disciples and sage Viswamitra decided to settle down in a cool and serene atmosphere after the Kurukshetra War. \n In the quest for a peaceful abode, he came to Dandaka forest and pleased with serenity of the region, selected this place. \n Since Maharishi Vyasa spent considerable time in prayers, the place was then called 'Vasara' and turned into Basara due to the influence of the Marathi language in the region. \n Timing: 4am to 12:30pm and 2pm to 8:30pm. \n Entry fee: prathaka akshara abyasam 500/-,akshara abyasam 150/-,kumkumma archana 250/-,norml dharshanam 20/-. \n Best time to visit: (Oct-Mar). \n Distance: 207 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Sri Narayan Swamy Temple-Jainath",
		"patterns":["Sri Narayan Swamy Temple-Jainath"],
		"responses":[" Sri Narayan Swamy Temple also known as Jainath Temple is an ancient temple built by Pallava chiefs. \n This temple is also popular for its Jain style architecture,The pillars inside the temple are extensive carved with beautiful sculptures. \n The outer walls of the temple and the vimana over the sanctum exhibit wonderful piece of art work. \n Jainath Temple is one of the ancient pilgrimage centers in Adilabad and also an important architectural monument of Pallava dynasty (4th to 9th century CE) in Telugu region. \n This is a small structure built on a platform which is 2 feet high. \n The temple is dedicated to Lord Lakshmi Narayana. \n The idol of the deity in the sanctum sanctorum is 6 feet tall in standing position and is made of black stone. \n Timing: 6am to 8 pm. \n Entry fee: 30/- \n Best time to visit: (Oct-Nov). \n Distance: 328 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Anjaneya swamy temple kondagattu",
		"patterns":["Anjaneya swamy temple kondagattu"],
		"responses":[" Situated on a hillock amidst beautiful hills, valleys and refreshing water springs, this is dedicated to Lord Hanuman. \n The temple besides the main deity of Anjaneya Swamy also has the idols of Lord Venkateswara, Goddess Alwaar and Sri Laxmi. \n Here one can see the life statue of Lord Anjaneya. \n According to local legend, about 300 years ago a farmer Singam sanjeevudu after losing one of his buffalos, came to this hillock searching for it and slept here. \n Lord Anjaneya came into his dream and told him the where abouts of his buffalo. \n As he woke up and looking around the hillock, he found an illuminating idol of Anjaneya. \n The present structure was built by Krishna Rao Deshmukh in the middle of 20th century. \n The devotees believe that people who do not have children will be blessed by offering 40 day prayers to Lord Anjaneya Swamy. \n Timing:4:00am to 8:30pm. \n Entry fee:60 Rs. \n Best time to visit: April. \n Distance : 147 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
         {"tag": "Sri Lakshmi Narasimha swami temple Dharmapuri",
		"patterns":["Sri Lakshmi Narasimha swami temple Dharmapuri"],
		"responses":[" The town was ruled by King Dharma Varma and thus the name of the town was named after him as Dharmapuri. \n It is located on the banks of holy river Godavari. \n The most interesting fact of Dharmapuri is that the Godavari river flows from north to south direction unlike west to east in all other places where it flows and hence the river is termed here as Dakshina Vahini. \n Dharmapuri has one of the largest settlements of Vedic Brahmins in Telangana. \n Due to presence of many temples in the area, it is also known as 'Teertharajamu'. \n Dharmapuri attained religious importance owing to the existence of the shrine dedicated to Narasimha Swamy, an incarnation of Lord Vishnu and is regarded as one of the nine Narasimha Kshetrams of Telangana & Andhra Pradesh. \n It is believed that the temple was built between 850 - 928 AD. \n This ancient Telangana temple has two versions owing to the ravages it has witnessed. \n Timing:5:00am to 2:30pm and 4:00pm to 8:00pm. \n Entry fee: free. \n Best time to visit: March-April. \n Distance: 229 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Mukteshwara swamy temple kaleshwaram",
		"patterns":["Mukteshwara swamy temple kaleshwaram "],
		"responses":[" Dedicated to Lord Shiva, this temple is unique because of two Shiva Lingas engraved on a single pedestal. \n According to legend, this temple was established by the Lord Yama and named Muktheshwara and at the same place lord Shiva appeared in the form of lingam on the same stone and named it as Kaleshwara. \n The devotees first pray to Yama at this shrine before proceeding to Lord Siva. \n Kaleshwaram is one of the most famous Shiva adobes in Telangana. \n This place is also called Dakshina Triveni Sangamam, as rivers Godavari and Pranahita meet here. \n It is believed that there is another river named Saraswati flowing under the Godavari hence it is called Triveni Sangamam. \n The Kaleshwaram is centre for Godavari pushkarams organised once in 12 years. \n Kaleswaram gets a huge number of piligrms during the Karthika masam and Shiva Ratri \n Timing:4:00am to 1:00pm and 3:30pm to 9:00pm. \n Entry fee: free. \n Best time to visit: March-April. \n Distance: 264 km from Hyderabad. \n Mode of transport: Bus or car "]
	},
        {"tag": "Sri koteshwara swamy temple",
		"patterns":["Sri koteshwara swamy temple"],
		"responses":[" Kotilingala is situated at the confluence of Peddavagu and Godavari River. \n It was one of the capitals of Satavahana dynasty. \n It was also the capital of Assaka Janapada, one of the 16 great janapadas of early India. \n Kotilingala is well known for Sri Koteswara Siddeshwara Swamy Temple. \n Dedicated to Lord Shiva, this temple was built by Sathavahana Kings between 2nd and 3rd centuries. \n It is one of the oldest and historical temples in Telangana. \n According to the legend, sages used to meditate in the caves adjoining the hillocks called Munula Gutta and visit the banks of the Godavari for bathing. \n The sages decided to construct a temple and asked Lord Hanuman to get a Siva Lingam. \n When Lord Hanuman failed to come on time, the sages installed a Siva linga made of sand. \n By the time Lord Hanuman arrived the Siva linga was completed leaving him angry. \n It is a custom here to first offer prayers to the Shivalinga brought by Hanuman and later to the linga made with sand. \n The temple is located inside the Kotilingala fort. \n It is a mud fort with several gates and a watch tower. \n The State government has decided to construct a protection wall along the shores of river Godavari to protect the site from submergence under the backwaters of the Sripada Yellampalli project. \n Timing: 4:00am to 1:30pm and 3:30pm to 9:30pm. \n Entry fee: Free. \n Best time to visit: March-April. \n Distance: 217 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Lakshmi Narasimha swamy temple,Nampally",
		"patterns":["Lakshmi Narasimha swamy temple,Nampally"],
		"responses":[" The temple is nestled on a small hillock on the Vemulawada - Karimnagar highway. \n It is a small shrine dedicated to Lord Lakshmi Narasimha, an incarnation of Lord Vishnu. \n The idol was carved out of the rock around which the temple was built. \n The visitors have to walk a few hundred steps that lead to the top from nearest the parking area at bottom. \n The climb is little steep may take up to 15 minutes. \n One the way to the Narasimha temple, there is a temple for Naga Devatha. \n The temple was built in a model of Snake. Visitors can enter the shrine through the snake's belly - a long, winding tunnel. \n There are statues depicting the story of Prahalada and Hiranyakasipu. \n At the end of the tunnel, the statue of Lord Narasimha killing the demon Hiranyakasipu is present. \n Timing: 24 hours open \n Entry fee: Free. \n Best time to visit: any time. \n Distance: 150 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Sri Raja Rajeshwara swamy temple,Vemulawada",
		"patterns":["Sri Raja Rajeshwara swamy temple,Vemulawada"],
		"responses":[" Vemulawada is famous for the temple of Rajarajeshwara Swamy, an incarnation of Lord Shiva. \n It was built by one of the governors of Kalyani Chalukyas by name Rajadithya between 11th and 12th centuries. \n The presiding deity is locally popular as Rajanna who is accompanied by the idols of Sri Raja Rajeswari Devi and Siddi Vinayaka. \n It houses several temples dedicated to other deities including Anantha Padmanabha Swamy, Bhimeshwara Swamy, Kodanda Rama and Kasi Visweswara. \n Apart from these there is a tomb of Muslim saint. \n Located on the banks of Mulavagu stream, Vemulawada was once the capital city of Vemulawada Chalukyas dynasty between 750-973 CE. \n The remains of the temples and sculptures show the great architecture of Chalukyas. \n There are several inscriptions available that refer the reign of Chalukyas. \n Timing:24 hours open. \n Entry fee: free. \n Best time to visit: March-April. \n Distance: 150 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Bhadra kali temple",
		"patterns":["Bhadra kali temple"],
		"responses":[" The Bhadra Kali Temple is situated on top a hillock towards Hanamkonda. \n This temple is famous for 2.7 meter stone idol of the deity with eight arms and a weapon in each hand, in sitting posture. \n This deity is believed to be worshipped by the Chalukyan ruler Pulakesin-II in the year 625 AD. \n The temple is dedicated to Goddess Kali, found in peaceful mood. \n This temple is located on the banks of Bhadrakali Lake. \n There is a park adjacent to the temple along Bhadrakali Lake which also has a shrine for Lord Siva in the form of Sri Chandra Mouleeswara. \n Brahmotsavas are held every year in the month of April/May in a grand manner. \n The festival attracts thousands of devotees from all over the region of Telangana. \n No lunch break during festivals. Photography not allowed. \n Timing:5:00am to 1:00pm-3:00pm to 9:00pm. \n Entry fee: Free. \n Best time to visit: March-April. \n Distance: 151 km from Hyderabad. \n Mode of  transport: BUS or car."]
	},
        {"tag": "Jain Temple,Kolanupaka",
		"patterns":["Jain Temple,Kolanupaka"],
		"responses":[" The 2000 years old Jain Temple of Mahavira is located in Kolanupaka village (also called as Kulpak) in Nalgonda district. \n The temple is decorated with beautiful images of Tirthankaras and it's one of the important Jain pilgrimage sites in the country. \n It is also a popular place to visit around Warangal & Hyderabad. \n Kulpakji is an important pilgrimage center for Swetambara Jains of South India. \n This is one of the popular one day trip near Hyderabad and among the prime place to visit on a Hyderabad tour. \n According to the mythological legend, the main temple of Kolanupaka is said to have been built by Emperor Bharata, son of King Dushyanta and Queen Sakuntala. \n Jainism was prevalent in Andhra Pradesh & Telangana before the 4th century and Kolanupaka was one of the prominent centers of Jainism from early times. \n About 20 Jain inscriptions have been found there. \n It is said that Kolanupaka flourished as Jain center during the Rashtrakutas period. \n This temple has three main idols of Gods, called as Tirthankars. \n Timing: 6:00am to 6:00pm. \n Entry fee:50 Rs. \n Best time to visit: March-April. \n Distance: 80km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Ramappa temple",
		"patterns":["Ramappa temple"],
		"responses":[" Ramappa Temple is an ancient temple built by a General Recherla Rudra, during the period of the Kakatiya ruler Ganapati Deva in 1213 AD. \n The history says that it took 40 years to build this temple. \n This temple is constructed in the South Indian architectural style and is devoted to Lord Shiva. \n The temple got its name from Ramappa, the chief sculptor of the temple. \n It's probably the only temple in the country to be known by the name of its sculptor. \n The temple stands on a 6 feet high star-shaped platform. \n The sand stone temple is crowned with a grand sikhara and is surrounded by pradakshina patha. \n The Ramalingeswara Temple consists of garbhagriha, large ranga mandapa and a mukha mandapa. \n At the entrance of the temple, we can find a large Nandi mandapa. \n An imposing 9 feet Nandi statue is quite famous here. \n The corners of the ceiling at all 3 entrances have total of 12 sculptures of madanikas marvelously carved in different poses, which are the main attraction of the temple. \n Timing:6:00am to 6:00pm. \n Entry fee: Free. \n Best time to visit: March-April. \n Distance: 145 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
         {"tag": "Sammaka Sarakka temple jatara,Medaram",
		"patterns":["Sammaka Sarakka temple jatara,Medaram"],
		"responses":[" Medaram is famous for Samakka Sarakka Jatara held once in every two years during the month of February. \n It is located within Ethurnagaram Wildlife Sanctury. \n Sammakka is mother of Sarakka; both belong to the tribal community in Medaram village. \n In 14th century, Sammakka & Sarakka fought against Kakatiyas ruler Prathaparudra who tried to occupy the tribal territories. \n Finally, they lost their lives along with all their family members during the brutal fight. \n The Sammakka Sarakka Jatara (Festival) is held to offer tribute to the brave mother-daughter warriors. \n Approximately 6 million people converge over three days around the small village of Medaram and its adjacent, Jampanna Vagu. \n This fair is said to be the largest repeating aggregation of tribal communities in the whole world. \n Timing: 24 open. \n Entry fee: Free. \n Best time to visit: March-April. \n Distance: 238 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Thousand Pillar temple",
		"patterns":["Thousand Pillar temple"],
		"responses":[" Thousand Pillar Temple is one of the finest examples of Kakatiya architecture. \n Rudra Deva built this temple in 1163 AD in the style of star shaped Chalukyan temples and named after him as Sri Rudreshwara Swamy Temple, it is dedicated to Lord Shiva. \n Separate shires for Lord Surya & Lord Vishnu in the temple are connected to main shrine by a square mandap in the centre. \n A beautifully carved giant Nandi (bull) is seen on the platform connecting the shrines. \n The exterior wall of the temple, the ceiling slabs and the four central pillars of the mandap are decorated with finely carved sculptures. \n Poojas are still performed. The actual thousand pillar hall situated behind Nandi in the temple complex is currently being renovated by the archelogical department and closed for visitors. \n The temple is located between Warangal and Hanmakonda Chowrasta, close to main road. \n Timing:6:00am to 8:00pm. \n Entry fee: Free. \n Best time to visit: March-April. \n Distance: 154 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Dargha hazrat syed shah lateefullh qadri",
		"patterns":["Dargha hazrat syed shah lateefullh qadri"],
		"responses":[" Lateef Ullah Shah Quadri Darga or Lateef Saheb Dargah is a Sufi shrine located in the town of Nalgonda district, Telangana, India. \n It is situated on hillock. \n Pilgrims and tourists trek the hammock to succeed in the shrine and supply their prayers. \n This Dargah celebrates a three-day urs per annum, that is attended by sizable amount of devotees. \n Nalgonda could be a residential district from earlier period, fantastically set amidst two hills with a fort on one of the hills and a large rock structure wherever the Lateef Saheb Dargah is currently settled. \n Another vital feature of this hill is that of an outsized reservoir of water inside a hollow of the rock. \n Another aspect is that through a little gap, one can check if water is accessible, though most of the time water is present to the brim.For the hill is termed as Kapuralagutta which means a family residential, where the families of the rulers were living safely. \n There's a water storage purpose on this hill similarly for the residents’ use. \n During the time of Bahamani swayer, Shihabud-din Mahmun swayer Quli had functioned as Tarafdar of Telangana region of province. \n Timing: 6:00am to 8:00pm. \n Entry fee: Free. \n Best time to visit: any time. \n Distance: 102 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
         {"tag": "Pachala someshwara temple",
		"patterns":["Pachala someshwara temple"],
		"responses":[" Chaya Someswara Temple is a wonderful temple located at Panagal in Nalgonda district of Telangana. \n This is an interesting pilgrimage and historical site to visit from Nalgonda & Hyderabad. \n Sri temple was built during 11th - 12th centuries by Cholas. \n The temple got the name as it is believed that the formation of relentless shadow (Chaya in Telugu) of a pillar falls over the main deity of Shivalingam throughout the day. \n This amazing temple, engineered by the Kunduru, testifies the fantastic creative thinking and scientific knowledge of its architects. \n The complex houses three deities - Brahma, Vishnu and Shiva facing three different directions connected by common mahamandapa. \n The temple also demonstrates wonderful sculpture and art work. \n The temple is known for its architecture. \n One of the garbhagrihas situated in the west and facing east contains a continuing shadow of a pillar throughout the day. \n This mysterious shadow is a huge attraction of the temple. \n The chaya that falls on the deity looks like a shadow of one of the pillars carved in front of the sacred chamber. \n But it is not actually the shadow of any pillar. \n The dark area is formed by the reflection of light through multiple pillars placed in front of garbhagriha and the shadow is a consolidated shadow of those four pillars. \n Timing:6:00am to 12:00pm and 2:00pm to 8:00pm. \n Entry fee: Free. \n Best time to visit: March-April. \n Distance: 101 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
        {"tag": "Sri chaya someshwara temple",
		"patterns":["Sri chaya someshwara temple"],
		"responses":[" Chaya Someswara Temple, also known as Chaya Someshvara Swamy Alayam, is a Saivite. \n The temple has three sanctum sanctorum, a form of temple architecture that is called Trikutalayam (three-shrine complex). \n These are dedicated to Shiva, Vishnu and Surya. \n The three shrines share a common hall (mandapam) with intricately carved pillars. \n These carvings depicts scenes from the Mahabharata, Ramayana and Puranas. \n The temple has stepped pyramidal sikharas and was probably built in the 11th and 12th centuries CE during the rule of Kunduru Chodas and Prataparudra I of Kakatiya Empire over the Panagal region. \n The temple is a popular pilgrimage site during Maha Sivaratri. \n The temple is in close proximity to Pachala Someswara temple, another Saivite shrine in Panagal. \n The pillars in the Ardhamandapa and open spaces near the central Shiva shrine were designed and placed by the temple architect in such a way as to cast a unified shadow (Chaya in Telugu) constantly on the lingam all through the day, irrespective of the position of the sun. \n This gave its name to the temple - Chaya Someswara Swamy temple. \n This temple was built in the 11th and 12th centuries CE by the Kunduru Chodas. \n Parts of the temple were also built during the reign of the Kakatiyas. \n Timing: 5:00am to 12:30pm and 2:00pm to 9:00pm. \n Entry fee: Free. \n Best time to visit: March-April. \n Distance: 102 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
        {"tag": "Swayambhu Shambhu lingeswara temple",
		"patterns":["Swayambhu Shambhu lingeswara temple"],
		"responses":[" Sri Shambhu Lingeswara Temple is located at Mellacheruvu in Nalgonda district of Telangana.Sri Shambhu Lingeswara Temple is one of the most celebrated temples in Nalgonda district. \n The presiding deity the temple of is Lord Shiva in the divine form of Sambhu Lingeswara Swamy. \n Lord Shiva here is believed to be self incarnated. \n The temple is believed to be at least thousand years old making it one of the ancient temples dedicated to Lord Shiva in the state. \n The temple architecture reflects the glory of Kakatiya dynasty. \n A notable feature of the temple is that on top of the Shivalingam there is a circular hole about 2 inches (5 cm) and water keeps flowing through the hole in all seasons. \n This is also known as Swayam Abhishekha Linga (self purifying linga). \n There is also a belief that the Shivalinga in the temple is growing in height. \n According to the legend, during the Kakatiya period, a cowherd saw a cow go and empty its udder over Shiva Linga. \n A cowherd doesn't know that it is Shiva Linga. \n Timing: 7:00am to 12:30pm and 2:30pm to 9:00pm. \n Entry fee: Free. \n Best time to visit: March-April. \n Distance: 196 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Wild life sanctuary",
		"patterns":["Wild life sanctuary"],
		"responses":[" 1. Mallaram forest \n 2. Kawal Wildlife Sanctury \n 3. Pranahita Wildlife Sanctuary \n 4. Shivaram Crocodile Wildlife Sanctuary \n 5. Kinnerasani Wildlife sanctuary \n 6. Nehru Zoological park"]
	},
        {"tag": "Mallaram forest",
		"patterns":["Mallaram forest"],
		"responses":[" Fresh air, chirping of birds, dense forest and beautiful surroundings; Mallaram Forest is all about that. \n Away from hustle and bustle of urban lifestyle, the forest is located in Nizamabad and is well accessible by road. \n Breathtaking views from hillocks will leave you reluctant to go away from this place. \n It is an ideal area for trekking and to experience some thrill. \n From the viewpoint tower, you could have spectacular views of the lush greenery around. \n Main attraction? The famous mushroom-shaped rock. \n As per geologists, it is over 2000 million years. So nature and history lovers, you know your next stop now!. \n Lush green environment, invigorating air and quietness of the woods beckon one to this place, situated about 7 km south west of Nizamabad town. \n This place houses rocks that are about a billion years old. \n Forest treks, Pagodas, View points to watch the wild, moonlit dinners are the main attractions of this place, aimed at promoting eco tourism. \n Breathtaking views from hillocks will surely leave you reluctant to depart from the place. \n Timing: 6:00am to 6:00pm. \n Entry fee: Free. \n Best time to visit: Monsoon and Post Monsoon(Aug-Dec). \n Distance: 182 km from Hyderabad. \n Mode of transport: Bus or Car"]
	},
        {"tag": "Kawal Wildlife Sanctury",
		"patterns":["Kawal Wildlife Sanctury"],
		"responses":[" Kawal Tiger Reserve is located at Jannaram mandal of Mancherial District (Old Adilabad district) in Telangana state of India. \n Govt of India declared Kawal wildlife sanctuary as Tiger Reserve in 2012. \n The reserve is the oldest sanctuary in the northern Telangana region of the state. \n It is well known for its abundant flora and fauna. \n This sanctuary is catchment for the rivers Godavari and Kadam, which flow towards the south of the sanctuary. \n The KWS was established in 1965 and later declared as a Protected Area(PA) in 1999 under the WPA, 1972. \n It was listed as tiger reserve in April 2012. \n In this regard habitat development is undertaken with release of 150 cheetals as prey population. \n To check poaching new check posts have been created. \n Traditional sources of water were improved. \n The sanctuary is one of the richest teak forests in the state, with dense pristine areas free of human disturbance. \n Timing: Monday-Sunday,6:00am to 6:00pm. \n Entry fee: prices varies according to safari package chosen. \n Best time to visit: (November-May). \n Distance: 259 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Pranahita Wildlife Sanctuary",
		"patterns":["Pranahita Wildlife Sanctuary"],
		"responses":[" Pranahita wildlife sanctuary is a protected area located in Mancherial district (Old Adilabad District) of Telangana State, India.This sanctuary is on the bank of Pranahita River, 35 km away from Mancherial town. \n It is famous for Blackbuck and over 20 species of reptiles, over 50 species of birds, over 40 species of mammals. \n Pranahita was established on 13 March 1980, and covers an area of 136.02 km. \n Pranahita is a southern tropical dry deciduous forests, with dry shrub jungle and grasslands. \n There are forest rest house at Mancherial and Chennur. \n Timing: Monday-Sunday,6:00am to 6:00pm. \n Entry fee: prices varies according to safari package chosen. \n Best time to visit: (November-April). \n Distance: 280 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
        {"tag": "Shivaram Crocodile Wildlife Sanctuary",
		"patterns":["Shivaram Crocodile Wildlife Sanctuary"],
		"responses":[" Lying on the banks of River Godavari,  Shivaram Wildlife Sanctuary is a wildlife preserve in India located in Mancherial district of Telangana and is with freshwater flora and fauna. Established in the year 1987,  Sivaram Wildlife Sanctuary is famous for marsh crocodiles which are also known as mugger crocodiles.located 10 km from Manthani, 40 km from Peddapalli, 80 km from Karimnagar and 30 km from Godavarikhani. This riverine forest mixed with teak and terminalia is spread over 36.29 square kilometres (14.01 sq mi) and is home to marsh crocodiles from the river Godavari. It also harbours Indian leopards, sloth bears, nilgai, blackbucks, chitals, pythons, and langurs. The undulating natural terrain adds to the beauty of the sanctuary. It also has bird species like parrots, peacocks, harpy eagles, vultures, and the pretty macaws \n Timing: Monday -Sunday(6:00am to 6:00pm) \n Entry fee: Free. \n Best time to visit: November to April. \n Distance: 261 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Kinnerasani Wildlife sanctuary",
		"patterns":["Kinnerasani Wildlife sanctuary"],
		"responses":[" Kinnerasani Wildlife Sanctuary is situated on the right bank of Godavari River and also it is part of Dandakaranya Forest. \n The sanctuary is named after the River Kinnerasani. \n This river divides the sanctuary and meets Godavari. \n The wildlife sanctuary is spread over an area of 635.4 sq km with the picturesque Kinnerasani Lake and densely forested islands in the middle of the sanctuary. \n The sanctuary is the home for many animals like Cheetal, Chinkara, Chousinghas, Sambar, Wild Boars, Gaurs, Hyena, Jackals, Panthers, Sloth Bear, Tigers and Black Bucks. \n The varieties of birds like Peafowl, Jungle Fowl, Quails, Partridges, Teals, Nuktas, Spoonbills and Doves are the common birds in the sanctuary. \n The sanctuary represents dry deciduous mixed type forests with teak, bamboo and terminals. \n Timing: 9:00am to 7:00pm. \n Entry fee: 10 Rs children,20 Rs adult. \n Best time to visit: (Oct-May). \n Distance: 293 km from Hyderabad. \n Mode of transport: BUS or car."]
	},
        {"tag": "Nehru Zoological park",
		"patterns":["Nehru Zoological park"],
		"responses":[" Nehru Zoological Park located in Bhadurpura is one of the most popular places to visit in Hyderabad and one of the biggest zoological parks in the country. \n Established in 1959, it is spread across 300 acres of lush green land. \n It houses over 1500 species of animals and birds. \n The park comprises a Natural History Museum, a Lion Safari Park and a children-s train. \n The Mir Alam Tank is with in the zoo park premise and boating facility is available here. \n Many species of birds like pelicans, peacock, dove, love birds, parakeets, pied horn bills, grey horn bills and manias, finches and buntings are found here. \n Timing: 8 AM to 5:30 PM. Closed on Mondays & Public holidays. \n Transport: cabs and auto, bus. \n Entry fee:Rs.30 for Adults, Rs.15 for Children, Rs.20 for Camera, Rs.100 for Video. \n Battery Operated Vehicle: Rs.50 for Adults & Rs.30 for Child. \n Safari: Rs.40 for Adults & Rs.10 for Children. \n Best time to visit:any time."]
	},
        {"tag": "Historic ",
		"patterns":["Historic"],
		"responses":[" 1. Warangal fort \n 2. Kush Mahal \n 3. Domakonda fort \n 4. Nizamabzd fort \n 5. Elgandal fort \n 6. Jagityal fort \n 7. Nagunur fort \n 8. Molangur fort \n 9. Ramagiri fort \n 10. Khammam fort \n 11. Bhongir fort \n 12. Devarakonda fort \n 13. Rachakonda fort \n 14. Gaandhaari Khilla \n 15. Chowmahalla palace \n 16. Falaknuma palace \n 17. Charminar \n 18. Qutab shai tombs \n 19. Macca Masjid \n 20.Golkonda fort"]
	},
        {"tag": "Warangal fort",
		"patterns":["Warangal fort"],
		"responses":[" At a distance of 5 Kms from Warangal Railway Station, the historic Warangal Fort was built by Kakatiyas in 12th Century AD. \n The King Rudradeva started construction of this Fort when the capital was shifted from Hanamankonda. \n It was further extended by his nephew, Ganapati Deva and was finally completed by Princess Rani Rudrama Devi. \n The fort was mostly destroyed by invaders and only the ruins can be seen now. \n It is one of the popular tourist places to visit near Hyderabad as a weekend getaway. \n Most of the fort is filled with settlements and small area in the center of fort has Open Air Museum with architectural remains of Kakatiyas. \n The famous stone gateways (called Kirti Toranas) are situated here, about 30 feet high and still standing, a masterpiece carved from a single rock. \n The Shambhulingeshwara Temple dedicated to Lord Shiva is opposite to Open Air Museum. \n Timing: 9:00am to 8:00pm \n Entry fee: Rs. 5 for Indian, Rs. 100 for Foreigners, Rs. 25 for Video Camera. \n Best time to visit: Any time. \n Distance: 148 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
        {"tag": "Kush Mahal",
		"patterns":["Kush Mahal"],
		"responses":[" Warangal Fort is located in Warangal District, Telangana, India. \n It was the capital city of Kakatiyas and Musunuri Nayakas. \n It appears to have existed since at least the 12th century when it was the capital of the Kakatiya dynasty. \n The fort has four ornamental gates, known as Kakatiya Kala Thoranam, that originally formed the entrances to a now ruined great Shiva temple. \n The Kakatiyan arch has been adopted and officially incorporated into the emblem of Telangana after the state bifurcation. \n 1 The Fort is included in the tentative list of UNESCO World Heritage Site. \n The Monument was submitted by the Permanent Delegation of India to UNESCO on 10/09/2010Initially, Warangal was under the rule of the Rashtrakuta dynasty in the 8th century AD and Western Chalukya Empire in 10th  century AD; in the 12th century, it came under the control of the sovereign Kakatiya dynasty \n Timing: 10:00am to 6:00pm. \n Entry fee: Rs. 5 for Indian, Rs. 100 for Foreigners, Rs. 25 for Video Camera. \n Best time to visit: Any time. \n Distance: 149 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
        {"tag": "Domakonda fort",
		"patterns":["Domakonda fort"],
		"responses":[" Domakonda was a princely region under Qutb Shahis and Asaf Jahis. \n The Reddy rulers of Domakonda built the fort in the 18 century at a sight where a fort existed earlier. \n The fort posses wonderful architecture to be explored and stands a testimony to the grandeur of Telangana heritage. \n This fort is also called Gadi Domakonda or Killa Domakonda. \n It is one of the beautiful forts present in Telangana. \n The architecture of the fortress displays both Hindu and Muslim styles. \n It has an elevated compound of granite rocks that forms the fort wall, followed by the beautiful two-storied fort structure. \n There are two palaces and a temple complex inside the fort along with a lotus pond. \n The ground floor of the palace consists of arched pillars with intricate artwork influenced by Mughal architecture. \n Timing: 7:00am to 6:00pm. \n Entry fee: 50 rs. \n Best time to visit: any time. \n Distance: 113 km from Hyderabad. \n Mode of transport: Bus or Car"]
	},
        {"tag": "Nizamabzd fort",
		"patterns":["Nizamabzd fort"],
		"responses":[" Nizamabad Fort is one of the important historical monuments of the Nizamabad city. \n It is an ancient fort was built by the Rashtrakuta kings who ruled this region. \n This magnificent fort was occupied by Allauddin Khilji, followed by the Bahamanis, Qutub Shahis and eventually by Mughals. \n The fort standing on a small hill at an altitude of about 300 m has an entrance with a huge arch shaped gate made of stone. \n The fort went through few changes over the centuries. \n Dating back to the 10th century, the colossal fort is encircled by fortifications and bastions. \n The present fort has a wide area encircled by masonry walls along with huge bastions at the corners. \n The inner part of the fort reflects the Nizam style of architecture with spacious halls and a summer house. \n The fort offers an excellent panoramic view of the Nizamabad city and its surroundings. \n Other major attractions of the fort include a jail, a mosque and a Rama temple. \n Timing: 24 hours open. \n Entry fee:50 rs. \n Best time to visit: any time. \n Distance: 176 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
        {"tag": "Elgandal fort",
		"patterns":["Elgandal fort"],
		"responses":[" The fort had been a centre of power of various dynasties, including the Kakatiya dynasty, Bahmanis, Qutub Shahis, Mughals and Asaf Jahis. \n The fort was appointed as the headquarters of Karimnagar during the rule of the Nizams of Hyderabad. \n In earlier times, Elgandal is also called as Bahudhanyapuram, Tellakandula and Veligandula. \n And finally in course of time, the name changed to Elgandal. \n Elgandal Fort is one of the best survived forts in Telangana. \n The Fort is located on a hillock. \n There are 300 well laid steps providing access to the fort. \n The East entrance of the fort, the Brundavan pond, the Mosques and graves in the fort are various points of attraction for tourists. \n Within the premises of the Fort exists various tombs of Muslim saints. \n These include the dargahs of great saints like Syed Shah Munawar Quadri Saheb, Doola Shah Saheb, Syed Maroof Saheb, Shah Talib Bismilla Saheb and Vali Hyder Sahib. \n These attract devotees in huge numbers. The Alamgir mosque, built by the Mughal Emperor Aurangzeb is a major attraction. \n Timing: 10:00am to 5:00pm. \n Entry fee: Free. \n Best time to visit: any time. \n Distance: 178 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
        {"tag": "Jagityal fort",
		"patterns":["Jagityal fort"],
		"responses":[" The Jagityal fort was built during the reign of Nawab Ibrahim, a Governor in the Mughal dynasty. \n The Mughal rulers used it as a defence fort in the 17 century. \n The structure was constructed by 2 French engineers. \n It bears a strong resemblance to the castles of Europe. \nThe fort was built with stones and lime and it had a moat around that was filled with water. \n The fort has two wooden gates, which were lifted by using pulleys. \n This is the only star-shaped fort in Telangana with a moat (water body). \n It is surrounded by four water bodies. \n History says that there used to be a row of rooms for the storage of ammunition at this fort. \n Though most of this fort is now in ruins; its uniqueness still makes it an interesting site, attracting several visitors.One of the prominent monuments in the fort is the Jama Masjid which was established in the 18th century. \n Timing:8:30am to 6:00pm. \n Entry fee: Free. \n Best time to visit: any time. \n Distance: 192 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
        {"tag": "Nagunur fort",
		"patterns":["Nagunur fort"],
		"responses":[" The Nagunur fort was constructed in the period of Kakatiya dynasty. \n This fort was one of the important forts in Kakatiyas kingdom. \n The Fort contains ruins of many temples. \n The origin and style of these temples can be traced back to the era of the Kalyani Chalukyas and Kakatiyas. \n However, it is strongly believed to have been built during 12th and 13th centuries under the patronage of the Kakatiyas. \n At one point of time this place was believed to house around 400 temples. \n The most important temple in the complex is the Shiva temple. \n The temple is made of red stone and consists of three shrines of Lord Shiva. \n The shrines are placed on a raised pedestal. \n Timing: 8:00am to 6:30pm. \n Entry fee: Free. \n Best time to visit: any time. \n Distance: 174 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
        {"tag": "Molangur fort",
		"patterns":["Molangur fort"],
		"responses":[" The Molangur fort was constructed on a hillock by Voragiri Moggaraju, one of the chief officers of Prathapa Rudra of Kakatiya dynasty. \n It was constructed as a transit halt for Kakatiyas while travelling from Warangal fort to Elgandal Fort in Karimnagar. \n The Molangur fort is listed as protected site by the Archaeological Department. \n The fort is constructed on a huge granite hill that made it difficult for anybody to climb it from any side. \n On the way to the top of the hill, an inscription carved on a boulder mentions that there are two ways to the fort. \n At the entrance of the fort there is a Dargah of Molang Shah Wali, a muslim saint. \n It is reported that the original name of the village was Mudugar. \n It appears to have been renamed as Molangur after the name of the Muslim saint Molang Shah Wali. \n In addition to the Dargah, the fort also houses two temples dedicated to Lord Shiva. \n There is a beautiful tank on the fort and also on its foothills along with a well called Doodh Bowli (milky well). \n Timing: 8:30am to 6:00pm. \n Entry fee: Free. \n Best time to visit: any time. \n Distance: 166 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Ramagiri fort",
		"patterns":["Ramagiri fort"],
		"responses":[" Ramagiri Fort often referred as Ratnagarbha has as ancient fort believed to be used by Satavahanas and Kakatiyas as their Military establishment. \n Ramagiri Fort is a picturesque hilltop fort built using stone with a number of bastions spread across a huge area across the hill. \n It gives a great view of the merging of the rivers Manair and Godavari. \n It is also known as Aaram-Giri because of the thick greenery and the beautiful views. \n There is a temple dedicated to Lord Rama and Sita on one side of the hill. \n There is also a Shiva linga which was believed to be installed by Lord Rama. \n There is also a seasonal waterfall on this hillock. \n The fort houses several buildings, bastions, mosques, tombs, Prataparudruni Kota, Horse stable Elephant shed, the prison, a huge dining hall, an enormous Hall, secret passages, narrow paths, guns, cannons, cannon balls, the ruins of Chitrakota, Tratikota, Nimmakota, Nagara khana and ammunition rooms. \n There are numerous wells built by various rulers like the Topubavi, Nallakayyabavi, Pasarubavi, Haribavi, Achchammabavi and Ammagaribavi etc. \n This fort is between Karimnagar and Manthani. \n Timing: 10:0am to 5:00pm. \n  Entry fee: Free. \n Best time to visit: any time. \n Distance: 227 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Khammam fort",
		"patterns":["Khammam fort"],
		"responses":[" Built during 950 AD by the Kakatiya rulers, the fort is an important tourist attraction in Khammam. \n Later, Musunuri Nayaks and Velama kings were involved in the expansion of the fort. \n Subsequently the Qutb Shahi kings developed the fort further. \n The fort is situated on Stambhadri hill. \n It represents a combination of both Hindu and Muslim architectural influences. \n There are several mandapas and temples inside the fort. \n The fort and the temples located on top make the place a wonderful site to visit in Khammam. \n The steps constructed to reach the top have made access to the fort easier. \n This fort was built with granite and has an area of around 4 square km. \n It also has a Masjid and Mahal including Ashoor Khanas constructed during Nizam period. \n The fort also houses several cannons that were used in the wars during Kakatiya & Qutb Shahi period. \n Timing: 24 hours open. \n Entry fee: Free. \n Best time to visit: any time. \n Distance: 196 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Bhongir fort",
		"patterns":["Bhongir fort"],
		"responses":[" Bhongir Fort was built in 12th century by the Western Chalukya ruler Tribhuvanamalla Vikramaditya VI and was thus named after him as Tribhuvanagiri. \n This name gradually became Bhuvanagiri and subsequently Bhongir. \n The Bhuvanagiri Fort is located on a huge monolithic rock. \n The hill upon which the fort itself is built is about 500 feet high and spread on about 40 acres of land. \n The Bhongir Fort is a unique egg-shaped construction with two entry points protected by huge rocks, so the fort was considered practically impregnable by invading armies. \n A moat encircles the fort and the place itself has a huge underground chamber, an armory, stables and trap doors, among others. \n The hilltop gives a wonderful bird's eye view of the surrounding area. \n The old steps from bottom to top of the hill are in good shape and can have thrilling experience by climbing this hill. \n The fort is associated with the rule of the iconic queen Rudramadevi and her grandson Pratapa Rudra. \n Later the impregnable fort was captured by the Qutb Shahi Kings and extended during their rule. \n Apart from the fort, there is a Hanuman temple and a number of ponds that can be seen at the hilltop. \n Timing: 10:00am to 5:00pm. \n Entry fee: 10 Rs children,20 Rs adult. \n Best time to visit: any time. \n Distance: 101 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Devarakonda fort",
		"patterns":["Devarakonda fort"],
		"responses":[" Devarakonda Fort acted as a prominent fortified defensive structure of the rulers of Recherla Velama dynasty that rules parts of Telangana after Kakatiyas. It was built in the 14th century by the Velama Kings. The territory of Devarakonda was developed by the Padma Nayaka Velama rulers. The fortress was controlled by the ruling family from 1287 AD to 1482 AD. Then the fort was ruled by Maada Naidu who was the 8th king among the Padma Nayaka rulers. He was a great warrior and an educationist apart from being a kind ruler. During his reign, Devarakonda flourished with many temples and heritage sites.This fort is famous for its architectural brilliance. The fort is surrounded by seven hills with some great rocks and boulder and few forest. The fort built over a hilltop has large walls with curved bastions along with it. The fort ramparts were built with artillery and cannon points. The fort complexes are built up to 2 storeys. Timing:24 hours open. Entry fee:Free. Best time to visit : any time. Distance : 101 km from Hyderabad. Mode of transport : Bus or car."]
	},
        {"tag": "Rachakonda fort",
		"patterns":["Rachakonda fort"],
		"responses":[" The Rachakonda Fort was constructed in 14th century by Recherla Singama Nayak from Padma Nayaka dynasty who ruled the region of Rachakonda. \n The Fort was the capital to the Rachakonda region. \n The region was first ruled by Kakatiyas, Padma Nayakas, Bahmani Sultans, Qutub Shahi and finally Nizams. \n The Rachakonda fort is a good example of medieval Hindu fort architecture. \n It is a structure made of large stones. \n The fort built as a two story structure was constructed without using any mortar. \n The hills surrounds the Fort also provide good opportunity for trekking and provide panoramic view of the plains below. \n At the entrance, there are gateways made of stone pillars and horizontal beams. \n The exterior walls of the building are built with stone and the interiors are layered with mud. \n The structure of Rachakonda Fort was strategically developed as a defensive bastion with strong fortifications. \n Recently, A 6 feet Shiva Lingam was found when unidentified people started digging for treasure at Rachokonda Fort. \n Timing:10:00am to 5:00pm. \n Entry fee: Free. \n Best time to visit: any time. \n Distance: 57 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Gaandhaari Khilla",
		"patterns":["Gaandhaari Khilla"],
		"responses":[" The fort was built in the 12th century by the Gondu tribals with the help of the Kakatiya Kings of Warangal. \n Archaeological work suggests that construction of the fort was begun early as the Rastrakuta era (prior to 1200 A.D.) and continued until 16th century. \n All the sculptures, gate (thoranam) and pillars were constructed in Kakatiya style. \n By observing the decorations, the shanku and chakra, beside every sculpture we find that they are dedicated to Vishnu, while Kakatiya Kings worshipped Shiva. \n After Kakatiya Kings the fort was ruled by [The script of Shree Oddi raju anantha raju shasanam. \n Basically it belonged to the Kingdom of Gondus, but later on Oddi raju anantharaju occupied it. \n Later it was controlled by the Qutub Sahi Sultanate (1518–1687) and in 1656, the ruler of Golconda.Musunuri Nayaks|Musunuri Kings]] who united all Telugu nobles and revolted against Delhi sultanates. \n Later it was controlled by the Qutub Sahi Sultanate (1518–1687). In 1656, the ruler of Golconda. \n The forest in the area of the Gandhari fort is an important source for medicinal plants. \n Timing: Monday-Sunday(9:00am to 7:30pm). \n Entry fee: 50/-. \n Best time to visit: (Aug-Oct). \n Distance: 256 km from Hyderabad. \n Mode of transport: Bus or car"]
	},   
        {"tag": "Chowmahalla palace",
		"patterns":["Chowmahalla palace"],
		"responses":[" The name 'Chowmahallat' comes from two Urdu words, Chow (four) and Mahallat (palaces) means Four Palaces. \n While Salabat Jung initiated its construction in 1750, it was completed by Asaf Jah V, between 1857 and 1869. \n the palace originally covered 45 acres but only 12 acres remain today. \n It has a pure marble platform on which the royal seat 'Takht-e-Nishan' is laid. \n Khilwat Mubarak is also famous for its 19 chandeliers made of Belgian crystal. \n The Chowmahalla Palace complex also consists of a 250-year old Clock Tower (Khilwat Clock) The cars and other vehicles used by the royal families of Nizam are exhibited on the rear side of the palace. \n Timing: 10 AM to 5 PM. Closed on Fridays and on national holidays. \n Distance: 5 km from hyderabad. \n Transport: cabs and auto, bus. \n Entry fee: Rs.40 (Indians), Rs.150 (Foreigners), Camera: Rs.50 and Video Camera: Rs.100. \n Best time to visit: any time."]
	},
        {"tag": "Falaknuma palace",
		"patterns":["Falaknuma palace"],
		"responses":[" Falaknuma (meaning 'Star of Heaven') was designed by an Italian architect and its foundation was laid in 1884. \n The entire process of construction took 9 years. \n It was purchased by Nizam VI in 1897 and functioned as a royal guest house. \n The Palace is located atop a hill at an elevation of 2000 ft. and occupies a total area of 32 acre. \n The Nawab was an avid traveller and the palace has some of the finest collections of paintings, statues, furniture, manuscripts and books from around the world. \n This beautiful palace consisting of 220 extravagantly decorated rooms and 22 spacious halls. \n  The famed dining hall of the palace can accommodate 100 guests on its dining table. \n Timing: 4:00 pm – 5:30 pm only through Telangana Tourism - NIZAM PALACES TOUR Weekend Half-a-day tour (only saturday's and Sunday's). \n mode of Transport: cabs and auto, bus. \n Entry fee: Tour Option A: Rs.3,100/ Adult and Rs.2480/ Child Inclusions: Entry Tickets, Tea & Snacks, A/c Transport, Tour Guide. \n Tour Option B: Rs.2,000/Adult and Rs.1,600/ Child Inclusions: A/c Transport, Tour Guide. \n Best time to visit: any time."]
	},
        {"tag": "Charminar",
		"patterns":["Charminar"],
		"responses":[" The Charminar was constructed in 1591 by Mohammed Quli Qutub Shah to mark the end of an epidemic of plague in Hyderabad city. \n  Charminar is derived from two distinct words Char and Minar, which means four towers. \n It is a massive and impressive structure with four minarets. \n This is a square structure measuring 31.95 m on each side with imposing arches spanning a distance of 11 m. \n A row of small vaulted niches ornament each of the four arches. \n The four minarets are three storied structured rising to a height of 56 m. \n At the base of Charminar was originally a water pond at the center with a small fountain for customary ablutions, before offering prayers in the mosque. \n Timing: 8:00am to 10:00pm. \n Distance: 5 km from hyderabad. \n Transport: cabs and auto, bus. \n Entry fee: 5 Rs for indians,100 Rs for foreign tourist. \n Best time to visit: any time."]
	},
        {"tag": "Qutab shai tombs",
		"patterns":["Qutab shai tombs"],
		"responses":[" Qutub Shahi Tombs are the burial ground of the 7 kings of the Qutub Shahi dynasty. The tombs are very popular for their unique architecture and grand structures. Qutub Shahi Tombs are one of the best among Hyderabad tourist places and a major heritage site in Hyderabad city. There are more than 30 tombs in the enclosure besides some open air tombs. The tombs vary in size from small to large. The tombs are domed structures built on a square base surrounded by pointed arches, each tomb are quadrangular and rise from 9 to 15 meter above the platform. The largest of all Qutub Shahi Tombs is the tomb of Mohammed Quli Qutub Shah, the fifth king of the Qutub Shahi dynasty. This tomb reaching up to a height of about 42 meters has 28 open arches, a large dome and minarets at its corners. The basement of the tomb is open with large pillars and spread with arches supporting the main structure. \n Timing: 8:00am to 10:00pm. \n Distance: 5 km from Hyderabad. \n Transport: cabs and auto, bus. \n Entry fee: 5 Rs chidren,10 Rs adult,20 Rs camera. \n Best time to visit: any time."]
	},
        {"tag": "Macca Masjid",
		"patterns":["Macca Masjid"],
		"responses":[" Mecca Masjid, also called Makkah Masjid, is one of the popular tourist spots of Hyderabad attracting not just devotees but almost everyone. \n The construction of Mecca Masjid Hyderabad involved close to 8000 masons who worked round the clock. \n This construction went on for almost 77 years. \n Located in the Old City, at a distance of 100 metres from the Charminar. \n Mecca Masjid is one of the largest mosques not just in India but also in the world. \n The mosque has approximately 75-foot-high hall with dimensions of 220 feet by 180 feet. \n Interiors of the mosque are also beautifully decorated. \n It is believed that the main hall alone can accommodate 10,000 worshippers at a time. \n However, the construction was completed in 1687 by the Mughal Emperor Aurangzeb, after he took over the Golconda Kingdom. \n Timing: 4:00am to 9:30pm. \n Distance: 6 km from Hyderabad. \n Transport: cabs and auto, bus. \n Entry fee: Free. \n Best time to visit: any time."]
	},
         {"tag": "Golkonda fort",
		"patterns":["Golkonda fort"],
		"responses":[" The word 'Golconda' originated from Golla Konda which stands for Shepherd's Hill in Telugu. \n Golconda Fort was first constructed as a mud fort by the rulers of Kakatiya Dynasty in the 13th century. \n It was later re-built with granite by initial Qutub Shahi kings, which took about 62 years to complete. \n Golconda Fort was under the control of Qutub Shahis from 1518 AD to 1687 AD. \n The fort finally fell into ruins after the siege of Mughal Empire under Aurangzeb in 1687. \n The fortress was built on a granite hill that is 400ft high and surrounded by massive fortification walls. \n Golkonda consists of four distinct forts with a 10 km long outer wall having 87 semicircular bastions; some still mounted with cannons, eight gateways, four drawbridges and number of royal apartments, temples, mosques, armory, stables etc. \n The region is known for the mines that have produced some of the world's most famous gems, including the Koh-I-Noor, the Hope Diamond and the Nassak Diamond. \n Timing: 9:00am to 5:30pm. \n Distance:16 km from Hyderabad. \n Transport: cabs and auto, bus. \n Entry fee: 25 Rs for indians,300 Rs for foreign tourist,25 Rs for camera. \n Best time to visit: any time "]
	},
        {"tag": "Museum",
		"patterns":["Museum"],
		"responses":[" 1. Warangal Museum \n 2. Nizamabad museum \n 3. District archaeological museum \n 4. Archaeological museum \n 5. Birla planetarium and Science museum \n 6. Salar jung museum"]
	},
        {"tag": "Warangal Museum",
		"patterns":["Warangal Museum"],
		"responses":[" Warangal ASI Museum is a museum located in the musical garden complex in Warangal, Telangana, India. \n It is maintained by Archaeological Survey of India. \n It has a collection of Hindu, Buddhist and Jain sculpture housed in a single-storeyed building. \n The Notable pieces in the garden are a large Nandi and several Saivite sculptures along with the Marble Buddha and Chamunda. \n It also contains the 11th century Parsvanatha image and Shanmukha or Skanda from the 12th century Veerabhadra image. \n It also have the collection of ancient coins and pottery shards from the area. \n It describes the Kakatiya temple sites in the area, including the 13th century temples at Pillalamarri in Nalgonda district. \n Timing: 10:00am to 5:00pm. \n Entry fee: Rs. 10 for adults, Rs. 5 for children. \n Best time to visit: Any time. \n Distance: 150 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Nizamabad museum",
		"patterns":["Nizamabad museum"],
		"responses":[" Archaeological and Heritage Museum in Nizamabad is a must visit during your trip to the town because it is one of the best places to learn about our history including the evolution of humans from apes. \n The museum was opened in 2001 and has been divided into three sections – the Archaeological Section, the Sculptural Gallery and the Bronze Gallery. \n Each section shows in detail how the town has contributed in the history of ancient and modern India. \n In the Archaeological one can see the tools and equipment that were used by the humans between 50000 and 5000 B.C. \n There are many tools that are from the Paleolithic, Neolithic as well as the later Stone Age as well. \n Pottery from the Megalithic Age is also kept in the Archaeological Section, and has been dated as belonging to human civilization, which flourished between 1000 B.C and 3rd century B.C. \n While at the museum, be sure to check out the coin collection from the Medieval Period that includes coins from the reign of the Satavahanas, the Kakatiyas, the Qutub Shahis and the Ikshvaku. \n Timing: 9:00am to 9:00pm. \n Entry fee: 50 rs. \n Best time to visit: any time. \n Distance: 177 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "District archaeological museum",
		"patterns":["District archaeological museum"],
		"responses":[" Archeological exhibition hall, Karimnagar is an ideal goal for an extraordinary time with your dear ones. \n Appreciate the attractions of this prevalent traveler spot. \n With such a great amount to bait your faculties and offer you diversion taking care of business, get soaked in the soul of experience that you get the opportunity to investigate at archeological historical center, Karimnagar. \n Appreciate together every one of the purposes of prominent interests and bring back a few significant minutes. archeological exhibition hall, Karimnagar isn't the ideal place for touring, however it additionally empowers you to take a liberal minute for yourself took. \n World guidelines, uncommon engineering, imaginative formats, and well-thought execution make put a profoundly pined for purpose of visitor intrigue. \n Keep in mind to convey your camera and catch unique minutes. \n archeological gallery, Karimnagar is the certain method to revive and unwind after a bustling weekday. \n Timing: 7:00am to 5:00pm. \n Entry fee: Free. \n Best time to visit: any time. \n Distance: 165 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Archaeolgical museum",
		"patterns":["Archaeolgical museum"],
		"responses":[" Panagal Archaeological Museum is an archaeological museum located in Panagl village in Nalgonda district, Telangana, India. \n It is located in the premises of Pachala Someswara temple. \n It is also close to the Chaya Someswara temple at a distance of 1.3 km to the west of the temple. \n The museum was established in February 1982. \n The total area of the museum complex is nearly 3 acres. \n It has a collection of around 640 art objects and antiquities - sculptures, prehistoric tools, coins, bronzes, beads, arms and weapons, and copper plate inscriptions. \n Some objects are displayed in its open-air gallery while most items are located inside its building. \n The objects displayed in the museum were collected from excavations carried out in Vardamana Kota, Yeleswaram, Phanigiri, Panagal and many of them have also been acquired from the State Museum, Hyderabad, ranging from 2nd century CE to 18th century CE. \n Timing: 6:00am to 8:00pm. \n Entry fee: 10 Rs. \n Best time to visit: any time. \n Distance: 101 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
        {"tag": "Birla Planetarium and Science museum",
		"patterns":["Birla planetarium and Science museum"],
		"responses":[" The B M Birla Science Museum was the second phase of the Science Centre and it was opened in 1990. \n Birla Science Museum has various sections, each section presenting an amazing set of exhibits, each dedicated to a specialised field. \n These are Interactive Science Section, Archaeology and dolls museum, Nobel Gallery, Antarctica Diorama, NRSA, Dwaraka Diorama, IEEE and Dinosaurium. \n Another Section, Dinosaurium is something to look forward too. \n It is a truly breathtaking facility which displays a rare and magnificent fossil of the Dinosaur, Kotasaurus, belonging to the Lower Jurassic age, going back to about 160 million years. \n It has been put up in a natural and dynamic posture and measures about 14 m in length and over 5 m in height. \n The fossils were collected from Yamanpalli in the Adilabad district of Telangana. \n There is also an electronic section which explores the fascinating world of scientific developments. \n Art Gallery Timings: 10:30 AM to 8 PM. Planetarium Timings: 11:30 AM to 8 PM. Science Museum Timings: 10:30 AM to 8 PM. Show Timings: English - 11:30 AM, 4 PM, 6 PM; Telugu - 12:15 PM, 3 PM, 5 PM, 6:45 PM and Hindi - 7:30 PM. \n Distance:5 km from Hyderabad. \n Mode of Transport: cabs and auto, bus. \n Entry fee: Rs.80 for Planetarium, Rs. 80 for Science Museum, Rs. 75 for Art Gallery, Rs. 150 for Combo (Planetarium + Science Museum), and Rs. 200 for Combo (Planetarium + Science Museum + Art Gallery). \n Best time to visit: Any time."]
	}, 
        {"tag": "Salarjung museum",
		"patterns":["Salar jung museum "],
		"responses":[" The museum has a collection of over 50000 items for exhibition. \n There are 38 galleries in the Museum spread across three buildings- Central Block, Eastern Block and Western Block on two floors. The Central Block has 27 galleries (ground floor 15 galleries, first floor 12 galleries). \n The collection can be divided into Indian Art, Middle Eastern Art, Far Eastern Art, European Art and Children's Section. \n Apart from this, a gallery is devoted to the illustrious Salar Jung family, which was mainly responsible for acquiring the collection. \n Timing: 10 AM to 5 PM, Closed on all Friday & Public Holidays. \n Distance: 3 km from Hyderabad. \n mode of Transport: cabs and auto, bus. \n Entry fee: Rs.20 for Indians, Rs.500 for Foreigners & Rs. 50 for Camera. \n Best time to visit: any time."]
	},
 	{"tag": "Lakes ",
		"patterns":["Lakes "],
		"responses":[" 1. Laknavaram lake \n 2.Waddepally lake \n 3. Ramappa lake \n 4. Ali sagar lake \n 5. Lakaram lake \n 6. Tank bund and Hussain sagar lake"]
	},
  	{"tag": "Laknavaram lake",
		"patterns":["Laknavaram lake"],
		"responses":[" Built by Kakatiyas in 13th century, this is the largest lake in Warangal district. \n It still provides irrigation water for over 50,000 acres of land. \n The magnificent lake is surrounded by thick forests of Eturnagaram Sanctuary. \n The suspension bridge across the lake is a special attraction. \n Laknavaram is one of the best places to visit around Warangal and it's a perfect getaway to spend time with family. \n Boating facility is available in the lake on speed boats and motor boats. \n Telangana Tourism provides accommodation facilities along with a restaurant on the island in middle of the lake. \n Post monsoon is the best season the best season to visit this place when the lake is filled with water and the surrounding hills are covered with thick vegetation. \n To reach this place from Warangal, take Etunagaram highway, go straight past Mulug and Jangalapally (left turn here takes to Ramappa Temple - 11 Kms). \n Timing: 8:00am to 5:30pm. \n Entry fee: Rs. 10 for adults, Rs. 5 for children. \n Boating fee: 50 for Adults, Rs. 30 for Children, Rs. 300 for Speed boat (max 4). \n Best time to visit :Any time. \n Distance: 211 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
  	{"tag": "Waddepally lake",
		"patterns":["Waddepally lake"],
		"responses":[" The lake serves as a reservoir for drinking needs of the people of Hanamkonda and Kazipet. \n The beautification work of the lake's bund is being developed to aim at attracting tourists to the place. \n It is also a best spot for fishing, and it is located near a shiva temple. \n Govt of telangana recognised it and made it into a reservoir. now it pumps water for the city. \n Timing: 8:00am to 5:30pm. \n Entry fee: Free. \n Best time to visit: Any time. \n Distance: 138 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
  	{"tag": "Ramappa lake",
		"patterns":["Ramappa lake"],
		"responses":[" At a distance of 69 Kms from Warangal and 1 Km from Ramappa Temple, Ramappa Lake is a magnificent example of irrigation work of  Kakatiya Rulers. \n Constructed in 13th Century AD by King Ganapathi Deva, the waters of this lake are spread over an area of more than 82 Sq. Kms. \n The lake still provides water to irrigate 10,000 acres of land. \n The lake is over looked by beautiful hill ranges in the background providing a spectacular view especially at Sunset time. \n It is an excellent place for picnic and one can simply come here and relax under the shade of sprawling trees or walk around appreciating the beauty of nature. \n There is a small AP Tourism cottage near the lake which also serves food on demand. \n Timing: 7:00am to 6:30pm. \n Entry fee: Rs. 10 for adults, Rs. 5 for children. Boating fee:  15 for Adults, Rs. 10 for Children. \n Best time to visit: Any time. \n Distance: 211 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
 	{"tag": "Ali sagar lake",
		"patterns":["Ali sagar lake"],
		"responses":[" At a distance of 3.5 km from Jankampet Bus Stand, 13 km from Nizamabad Bus Station, 28 km from Basara and 187 km from  Hyderabad, Ali Sagar Dam is located near Jankampet village in Nizamabad district of Telangana. \n Ali Sagar Reservoir is a popular picnic spot in the region of Nizamabad. \n It was constructed by Nizams of Hyderabad in 1931 and it is a lift irrigation project. \n The lift canal originates from the back waters of Pochampadu Dam. \n There is a garden near the reservoir which was developed by the Nizams of Hyderabad. \n This garden is spread over a total land area of 33 acres and is popular for its fountains, tree house, deer park and a flower garden. \n The Ali Sagar Deer Park is situated near the reservoir was established in 1985 and hosts many species of deer. \n Timing: 10:00am to 6:30pm. \n Entry fee: 50 Rs. \n Best time to vist: Monsoon and Post Monsoon(Aug-Dec). \n Distance: 191 km from Hyderabad. \n Mode of transport: bus or car"]
	},
	{"tag": "Lakaram lake",
		"patterns":["Lakaram lake"],
		"responses":[" Lakaram lake is a lake in the city of Khammam. \n Located nearly 4 kilometres (2.5 mi) from a bus station, it is one of the main tourist attractions of the city. \n It has been developed recently under the auspices of Khammam MLA Sri Puvvada Ajay Kumar by the State government of Telangana under Mission Kakatiya. \n Until 15 years ago it was surrounded by trees, but today has an adjoined park named Lakaram Lake View. \n The lake is popular for boating. The lake serves as a drinking water source for the Khanapuram Haveli Suburb of Khammam. \n Timing: 5:00am to 8:00pm. \n Entry fee: 5 Rs children,15 Rs adult. \n Best time to visit: any time. \n Distance: 198 km from Hyderabad. \n Mode of transport: Bus or car"]
	},
    	{"tag": "Tank bund and Hussain sagar lake",
		"patterns":["Tank bund and Hussain sagar lake"],
		"responses":[" Connecting the twin cities, Hussain Sagar Lake boasts of being the largest artificial lake in Asia. \n On the tributary of  Musi River, it was excavated during Ibrahim Quli Qutub Shah’s reign, in 1562 AD. \n It has got its name after Hussain Shah Wali. \n The main attraction is 16 m high white granite statue of Lord Bhudda with a weight of 350 tonnes, situated at the middle of the lake. The lighting show here is worth watching. \n On the banks of this Hussain Sagar Lake the treaty between Mughals and Golconda was signed. \n Along with this,there are almost 30 statues of various famous personalities around the lake as well. \n Timing: 8:00am to 10:00pm. \n Distance:9 km from Hyderabad. \n mode of Transport: cabs and auto, bus. \n Entry fee: Free. \n Boating fee: Rs. 55 per Adult, Rs. 35 per Child, Rs. 250 for Jet Ski & Rs. 400 for Parasailing. \n Best time to visit: any time"]
	},
   	{"tag": "parks",
		"patterns":["parks"],
		"responses":[" 1.Kakatiya musical garden 2.Kaviraj nagar lakaram park 3.Lakararam tankbund park jammibanda park 4.KBR National park 5.Lumbini park 6.NTR gardens 7.Necklace road park 8.Shilparamam "]
	},
 	{"tag": "Kakatiya musical garden",
		"patterns":["Kakatiya musical garden"],
		"responses":[" At a distance of 5 Kms from Warangal Railway Station and 1 Km from Bhadrakali Temple, Musical Garden is a beautiful garden situated on the banks of Bhadrakali Lake. \n The main attraction of this garden is a magnificent musical fountain with a huge rock having an artificial water fall in the background. \n Though the park has Rose Garden, Children Park and Duck Pond, it's not a well maintained place. \n The park still attracts large crowd on weekends and Holidays. \n Boating in Bhadrakali Lake is available from here. \n The only show of Musical Fountain starts at 7:45 PM. \n The Planitarium adjacent to Garden entrance offers two shows daily at 6:30 PM and 7:45 PM. \n Timing: 9:00am to 8:00pm. \n Entry fee: 10 Rs ,20 Rs camera. \n Best time to visit: Any time. \n Distance: 150 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
   	{"tag": "Kaviraj nagar lakaram park",
		"patterns":["Kaviraj nagar lakaram park"],
		"responses":[" Garden is a beautiful with the Lake.The main attraction of this garden is a magnificent musical fountain with a huge rock having an artificial water fall in the background. \n Though the park has Rose Garden, Children Park and Duck Pond, it's not a well maintained place. \n The park still attracts large crowd on weekends and Holidays. \n the park is attched with lake and gorilla statue is the most attractive in park and beautifull water fountent and lots of greenery and plesant view of the park at night. \n Timing: 6:00am to 10:00pm. \n Entry fee:10 Rs children,20 Rs adult. Best time to visit : any time. Distance : 198 km from Hyderabad. Mode of transport : Bus or car."]
	},
  	{"tag": "Lakararam tankbund park jammibanda park",
		"patterns":["Lakararam tankbund park jammibanda park"],
		"responses":[" the park is close to Gorilla park that is also called as kaviraj nagar lakaram park at the distance of 2 km form the park. \n This park is very beautiful park in khammam because it most attraction place is the indian national flag is beside of the park the height is about 25fts and its also called as tankbund of the khammam district. \n Timing: 5:00am to 8:00pm. \n Entry fee: 5 Rs children,15 Rs adult. \n Best time to visit: any time. \n Distance: 195 km from Hyderabad. \n Mode of transport: Bus or car."]
	},
  	{"tag": "KBR National park",
		"patterns":["KBR National park"],
		"responses":[" KBR National Park boasts of rich flora and fauna which is accompanied by a refreshing environment that is ideal of relaxing. \n There are around 600 varied species of trees and plants trees in the park. \n The park has equally rich fauna. \n It has around 140 species of avian fauna along with 20 species of reptiles and 20 species of mammals. \n There are around 15 different species of butterflies as well. \n This area was declared as National Park in 1998 by the State Government, after getting the approval of central government. \n It was later declared as Kasu Brahmananda Reddy National Park in the memory of Late Chief Minister Kasu Brahmananda Reddy who was one of the popular leaders of the state. \n However, out of this around 11 acres of land was solely Nizam’s property. \n Eventually in 2010, the area has been reduced to 6 acres of land. \n This palace was built in the year of 1960. \n Timing: 5:30 am to 10:00 am- 4:30 pm to 6:30 pm. \n Distance: 10 km from Hyderabad. \n Transport: cabs and auto, bus. \n Entry fee: 20 Rs per Adult, 10 Rs per Child,400 Rs Monthly Fee per Person, 1000 Rs Yearly Fee per Senior Citizen,1500 Rs Yearly Fee per Person. \n Best time to visit: any time."]
	},
  	{"tag": "Lumbini park",
		"patterns":["Lumbini park"],
		"responses":[" Situated quite close to the famous standing statue of Lord Buddha and Hussain Sagar Lake, the largest artificial lake of Asia, the Lumbini Park is  a place worth visiting. \n One of the main attractions of the Lumbini Park is the giant clock at the entrance of the park which has been designed using various kinds of colourful flowering plants. \n Along with seasonal flowering plants, wide variety of cacti and rocks, the park also has many options to keep kids entertained. \n The Musical fountain and water cascades attract everyone. \n The sight of water shooting up to the sky, making a screen of water. \n The best part of laser show is that just 3D. \n You will see a city created in 3D right at a park. \n Musical fountain and the laser show at the Lumbini Park is something not to be missed. \n Timing: 9 AM to 9 PM. Closed on Monday. Musical Fountain timings (2 shows): 6:30 PM and 8 PM. Laser show timings (2 shows): 7.15 PM and 8.30 PM. \n Distance: 5 km from Hyderabad. \n mode of Transport: cabs and auto, bus. \n Entry fee: Rs.10 for Adults, Rs.5 for Children, Speed Boat (Adults / Children): Rs.50 per person, Ferry Boat (Adults / Children): Rs.40 per person and LASER Show: Rs.50 per person. \n Best time to visit: any time."]
	},
  	{"tag": "NTR gardens",
		"patterns":["NTR gardens"],
		"responses":[" Built in the memory of late Shri N T Rama Rao, former and one of the most popular chief ministers of Andhra Pradesh, NTR Memorial Gardens are one of the famous sightseeing places of Hyderabad. \n Spread across an area of 36 acres, NTR Gardens present a soothing atmosphere and refreshing setting to spend some time. \n The garden has been built with an approximate cost of Rs. 40 crore. \n It was in 2002, when the NTR garden of Hyderabad was opened to the public. \n Some of these are boat ride, Japanese garden, Roaring Cascade, a Fountain, etc. \n There is a Children's playing area that keeps kids entertained. \n The massive entrance plaza with Nandi Bulls is also quite captivating. \n the NTR garden is the Desert Garden, brian child of Mr. Nitish Roy, who has designed this project. \n It is consisted of about 150 plant varieties, mainly of those plans which are commonly referred as desert plants such as cacti, succulents, etc. Timing: 9AM to 9PM. \n Distance: 5 km from Hyderabad. \n mode of Transport: cabs and auto, bus. \n Entry fee: 20 Rs per Adult, 10 Rs per Child, 30 Rs for Still Camera, 65 Rs for Camcorder. \n Best time to visit: any time."]
       },
	{"tag": "Necklace road park",
		"patterns":["Necklace road park"],
		"responses":[" Necklace Road presents a fun filled yet calm environment to spend some relaxed moments. \n Built in the same way as the Queen’s Necklace of Mumbai, the Necklace Road of Hyderabad also resembles a necklace. \n Stretched across a length of three-kilometre, Necklace Road connects three major parks of the city, namely NTR Gardens, Lumbini Park and Sanjeevaiah Park. \n This gives it a shape of a necklace. The view of the lake from Necklace road, especially in the evening, is worth capturing. \n The view of the lake from the park is just mesmerising, making it an ideal place to sit and enjoy the natural scenic beauty. \n Timing: 24 hour \n Entry fee: Free. \n Best time to visit: sunrise and sunset (365 days) and ganesh chaturthi. \n mode of transport: cab or local train."]
	},
    	{"tag": "Shilparamam",
		"patterns":["Shilparamam"],
		"responses":[" Shilparamam is a craft village which presents various traditional arts and crafts by artisans from all over the country. A perfect place for art lovers, Shilparamam is one of the popular tourist spots in Hyderabad. \n Spread across an area of 50 acres, Shilparamam not just showcases various artefacts and traditionally made handicrafts but is also a home for various performing artists. \n In its complete form, the complex of Shilparamam is supposed to have Crafts Museum, Cultural Museum, Art Gallery & Library, Multi-purpose Auditorium, Common Facility Workshops and Research & Design Centre along with accommodation facilities for artists and visitors Craftsmen from all over India, display their works here, \n varying from traditional jewellery, hand-woven saris, shawls, dresses, bed sheets, etc; and hand-crafted wooden and metal wares. \n Timing: 10:30AM to 8:00PM. \n Distance: 17 km from Hyderabad. \n Transport: cabs, auto, and bus. \n Entry fee: 60 per person for Adults, 20 per person for Children.15 per person for Battery operated car ,20 per person for Bullockcot Ride. \n Boating fee: 30 per person Boating charges. \n Best time to visit: any time."]
	},
  	{"tag": "Bridge",
		"patterns":["Bridge"],
		"responses":[" 1.Durgam cheruvu cable bridge"]
	},
        {"tag": "Durgam cheruvu cable bridge",
		"patterns":["Durgam cheruvu cable bridge"],
		"responses":[" Situated quite close to the Hi-tech City, Durgam Cheruvu is one of the popular sightseeing places of Hyderabad. \n Presenting captivating scenic beauty, the lake is also known as the ‘Secret Lake’. \n This can be because of the fact that it is hidden by the surrounding granite rocks. \n The rock formations surrounding the lake are spread across an area of 63 acres of land and are said to be approximately 2500 million years old. \n It is said that the lake was used as the source of drinking water for the Golconda Fort. It is a common venue for film shootings, owing to its scenic beauty and unique location. \n Durgam Cheruvu Lake is surrounded by granite rocks, which is said to be a rare thing not just in India but in all over Asia. \n Timing:10:00am to 6:30pm. \n Distance:16 km from hyderabad. \n mode of Transport:cabs and auto,bus. \n Entry fee: Free. \n Boating fee: 200 Rs per person for floating restaurant,400 Rs for speed boat (4 max capacity),60 Rs for adult delux boat,30 Rs for child deluxe boat,Mechanized Boat, Water Scooter & Pedal Boat are also available here. \n Best time to visit: any time"]
	},
  	{"tag": "Film city",
		"patterns":["Film city"],
		"responses":[" 1.Ramoji film city"]
	},
        {"tag": "Ramoji Film city",
		"patterns":["Ramoji Film city"],
		"responses":[" Ramoji Film City is spread over a vast area of about 2500 acres, is a major film-making facility in India. \n It is Owned by film producer and media baron Ramoji Rao, the construction of RFC was completed in 1996. \n The Film City has been certified by Guinness World Records as the world's largest film studio complex. \n It can accommodate about 50 film units at the same time. The outdoor locations and lush greenery. \n Timing:9:00am to 5:30pm. \n Distance:32 km from hyderabad. \n Transport:cabs and auto,bus. \n Entry fee: Adult - Rs.1000, Child - Rs.900 for General Day Tour and Adult - Rs.2099, Child - Rs.1899 for Star Experience. \n Best time to visit:Oct-Feb."]
	},
  	{"tag": "Amusement park",
		"patterns":["Amusement park"],
		"responses":[" 1.Jalavihar Water park \n 2.Snow World"]
	},
   	{"tag": "Jalavihar Water park",
		"patterns":["Jalavihar Water park "],
		"responses":[" Jalavihar a popular amusement park, Jalavihar Hyderabad is situated on the Necklace Road which is in the heart of twin cities-Hyderabad and Secunderabad. \n Summer Carnival at Jalavihar starts from Apr 6th 2019 and ends at June 9th 2019. \n If in a mood to just relax, you can spend your time at the wave pool. \n Rain Dance is another place to be if you want to try something different from the slides. \n find here are Mini Coarsely, Mini train, Super-Jet, Battery cars, Mini rainbow wheel, Mini joker, Battery bikes, Air hockey, Water shooter, Basketball, Bungee Trampoline and almost 2000 people while the Aesthetic Vedhika can accommodate close to 300 people. \n Clothing for Men (Beach shorts / Tights / Shorts allowed (in Nylon only. Water park wear also available for Rental). \n Clothing for Women (SalwarKameez & Sarees strictly not allowed. Swim wear/ Leggings, Tights & Tees are allowed In Nylon based fabrics only. \n Water park wear also available for Rental). \n Clothing for Kids (Swim wear/ Beach wear in Nylon only allowed. Water park wear also available for Rental). \n Includes: Magic Show / Comedy show, Inflatable Bouncy Castle, Target shooting, Blind football, Rope climbing, Many Kids adventure games. \n Also Wave pool, SPL DJ Rain Dance with bollywood dance trainer, Body Slide, Twister Slide, Mat ride, Single Tube ride, Double Tube ride, Pendulum, Ladies & Kids pool (with Slides and activity). \n Dry rides as per rates fixed for each ride. Dry Rides Cost @ Jalvihar:Bungee Jump: Rs.50/-,Scary House: Rs.30/-,Cricket: Rs.30/-,Bouncy Castle: Rs.30/-,Water garbing: Rs.50/-,Bull Ride: Rs.50/-,Bumper Car: Rs.50/-. \n Timing: 11AM to 7PM. \n Distance: 9 km from hyderabad. \n Transport:cabs and auto, bus. \n Entry fee: Rs.350/- Per Person adult, Rs.250/- Per Person child. \n Best time to visit: April 6th and ends at June 9th."]
	},
  	{"tag": "Snow World",
		"patterns":["Snow World"],
		"responses":[" Snow World has been recognized as the first snow-themed park of the country. \n OPML has also developed the Ocean Park Theme Resort of Hyderabad. \n Spread across an area of 17,000 square feet, Snow World is apparently the biggest snow themed park in the world. \n Developed and conceptualized by Ocean Park Multi Tech Limited (OPML) A perfect spot to beat the scorching heat of summer Imagine throwing snow at each other without having to travel to any hill station. \n The temperature inside the Snow World varies from 0 to 5 degree Celsius. \n Adventurous sports like trekking up the slope more exciting. \n Along with this, other activities that one can do in Snow World are ice skating, ice boarding, snow slides with bumping-car, toboggan rides, etc. Games like Snow volley Ball, Snow Merry-Go-Round, snow basket ball, Snow Dancing are quite popular. \n Visitors are not allowed to take camera or mobiles inside so one cannot click any photos inside the snow world. \n All the snow produced at the Snow world is made up of mineral water. Warm clothes, gloves and other necessary things to keep you warm are provided at the venue itself. \n Snow World Blue Package (includes Snow world + Rain Forest + Living Dead + Kalledo):600 Rs for Adult (4ft 6inch & above),400 Rs for Child (2ft to 4ft 6inch),480 Rs for College Students (above 10th Class),430 Rs for School Students (upto 10th Class),Snow World Double Offer Package (includes Ocean Park + Snow world):800 Rs for Adult (4ft 6inch & above,500 Rs for Child (2ft to 4ft 6inch),600 Rs for College Students (above 10th Class),500 Rs for School Students (upto 10th Class). \n Timing: 11:00AM to 9:00PM. \n Distance: 6 km from Hyderabad. \n mode of Transport: cabs and auto, bus. \n Entry fee: 500 for Adult (4ft 6inch & above), 300 for Child (2ft to 4ft 6inch), 350 for College Students (above 10th Class), 300 for School Students (upto 10th Class). \n Best time to visit: any time."]
        }
]
}